sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
function showSettings() {
  document.getElementById('view-main').style.display = 'none';
  document.getElementById('view-settings').style.display = 'block';
  document.getElementById('view-history').style.display = 'none';
}
function showHistory() {
  document.getElementById('view-main').style.display = 'none';
  document.getElementById('view-settings').style.display = 'none';
  document.getElementById('view-history').style.display = 'block';
  fetchHistory();
}
function showMain() {
  document.getElementById('view-settings').style.display = 'none';
  document.getElementById('view-history').style.display = 'none';
  document.getElementById('view-main').style.display = 'block';
}

function fetchHistory() {
    const list = document.getElementById('history-list');
    fetch('/api/history')
        .then(r => r.json())
        .then(data => {
            list.innerHTML = "";
            if(data.length === 0) {
                list.innerHTML = "<div style='padding:20px; text-align:center; color:#888;'>履歴はありません</div>";
                return;
            }
            // 新しい順に表示
            data.reverse().forEach(item => {
                const row = document.createElement('div');
                row.className = 'history-row';
                row.innerHTML = `
                  <div class="h-info">
                     <span class="h-preset">${item.preset}</span>
                     <div class="h-detail">強さ:${item.strength}% / ${item.count}回</div>
                  </div>
                  <div class="h-time">${item.time}</div>
                `;
                list.appendChild(row);
            });
        })
        .catch(e => {
            list.innerHTML = "<div style='color:red; text-align:center;'>読み込みエラー</div>";
        });
}

function start() {
  const s = document.getElementById('inp-str').value;
  
  isManualStop = false;
  isRunning = true;
  document.body.classList.add('running');
  document.getElementById('status-badge').innerText = "準備中..."; 
  
  lastStartAction = Date.now();
  sessionStartTime = lastStartAction;
  
  runPreset = currentPresetName;
  runStrength = s;
  runCount = tgtCount;

  const h = parseFloat(document.getElementById('inp-hold').value) || 0.5;
  const r = parseFloat(document.getElementById('inp-reach').value) || 0.5;
  sessionTotalDur = tgtCount * (h + r + 0.3);
  if(sessionTotalDur < 1) sessionTotalDur = 1;

  // プリセット名も送信
  fetch(`/api/start?str=${s}&cnt=${tgtCount}&preset=${encodeURIComponent(runPreset)}`).catch(()=>{});
}

function stop() { 
  isManualStop = true;
  fetch('/api/stop').catch(()=>{}); 
}

function setOnline(isOnline) {
  if(isOnline) {
    document.body.classList.remove('offline');
  } else {
    document.body.classList.add('offline');
  }
}

// --- SMOOTH ANIMATION LOOP ---
function animateLoop() {
  if (isRunning && sessionTotalDur > 0) {
    const now = Date.now();
    const elapsedSec = (now - sessionStartTime) / 1000;
    const remaining = Math.max(0, sessionTotalDur - elapsedSec);
    
    document.getElementById('time-display').innerText = fmtTime(Math.ceil(remaining));

    let pct = (elapsedSec / sessionTotalDur) * 100;
    if (pct < 0) pct = 0;
    if (pct > 100) pct = 100;
    document.getElementById('yt-fill').style.width = pct + "%";
  }
  requestAnimationFrame(animateLoop);
}
requestAnimationFrame(animateLoop);

// --- SYNC WITH SERVER ---
function syncStatus() {
  fetch('/api/status')
    .then(r => r.json())
    .then(d => {
      setOnline(true);
      
      if(d.state !== 'IDLE') {
        if (!isRunning) {
          isRunning = true;
          document.body.classList.add('running');
          sessionStartTime = Date.now() - (d.elap || 0);
        }

        let txt = "動作中";
        if(d.state === 'PREPARE_SQUEEZE') txt = "準備中...";
        if(d.state === 'SQUEEZING') txt = "握り中";
        if(d.state === 'HOLDING') txt = "保持中";
        if(d.state === 'RELEASING') txt = "解放中";
        document.getElementById('status-badge').innerText = `${txt} (${d.cycle+1}/${d.total})`;

        sessionTotalDur = d.dur || 1; 
        const estimatedStart = Date.now() - (d.elap || 0);
        if (Math.abs(estimatedStart - sessionStartTime) > 500) {
           sessionStartTime = estimatedStart;
        }

      } else {
        if (isRunning) {
           if (Date.now() - lastStartAction >= 2000) {
             finishSession();
           }
        }
      }
      lastStatus = d.state;
    })
    .catch(e => {
      setOnline(false);
    });
}
setInterval(syncStatus, 1000);

function finishSession() {
  isRunning = false;
  document.body.classList.remove('running');
  document.getElementById('status-badge').innerText = "待機中";
  document.getElementById('yt-fill').style.width = '0%';
  updTimeDisp(); 
  
  if (!isManualStop) {
    showCompletionModal();
  }
}

function showCompletionModal() {
  const modal = document.getElementById('completion-modal');
  document.getElementById('detail-preset').innerText = runPreset;
  document.getElementById('detail-strength').innerText = runStrength + '%';
  document.getElementById('detail-count').innerText = runCount + '回';
  modal.classList.add('show');
}

function closeCompletionModal() {
  document.getElementById('completion-modal').classList.remove('show');
}

function manualServoAngle(angle) {
  document.getElementById('man-val').innerText = angle + '°';
  fetch(`/api/manual_angle?angle=${angle}`);
}
</script>
</body>
</html>
)rawliteral";

WebServer server(80);
DNSServer dnsServer;
const byte DNS_PORT = 53;
Preferences preferences;

Servo servo1, servo2, servo3;
const int PIN_SERVO1 = 18;
const int PIN_SERVO2 = 26;
const int PIN_SERVO3 = 27;

// --- サーボ設定 ---
const int US_AT_0_DEG = 500;    // 0度 (閉/強)
const int US_AT_270_DEG = 2500; // 270度 (開/弱)
const unsigned long DETACH_DELAY_MS = 5000;

// --- 履歴構造体 ---
struct HistoryItem {
  String timeStr;
  String preset;
  int strength;
  int count;
};
std::vector<HistoryItem> historyLog;
String currentSessionPreset = "Custom";

// 状態管理
enum State { IDLE, PREPARE_SQUEEZE, SQUEEZING, HOLDING, RELEASING, WAIT_CYCLE };
State currentState = IDLE;
State lastState = IDLE;

unsigned long stateStartTime = 0;
unsigned long sessionStartTime = 0;

// パラメータ
float holdTimeSec = 0.5;
float reachTimeSec = 0.5;
int targetStrength = 50;
int targetCount = 3;
int currentCycle = 0;
int pin13State = 0;

