sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
void setAllServosUs(int us) {
  servo1.writeMicroseconds(us);
  servo2.writeMicroseconds(us);
  servo3.writeMicroseconds(us);
}

void setAllServosAngle(int angle) {
  if (angle < 0)
    angle = 0;
  if (angle > 270)
    angle = 270;
  int us = map(angle, 0, 270, US_AT_0_DEG, US_AT_270_DEG);
  setAllServosUs(us);
}

int strengthToUs(int strength) {
  if (strength < 0)
    strength = 0;
  if (strength > 100)
    strength = 100;
  // 270度(開) → 90度(最大閉) の範囲に制限
  int targetAngle = map(strength, 0, 100, 270, 90);
  return map(targetAngle, 0, 270, US_AT_0_DEG, US_AT_270_DEG);
}

void attachAllServos() {
  if (!servo1.attached())
    servo1.attach(PIN_SERVO1, US_AT_0_DEG, US_AT_270_DEG);
  if (!servo2.attached())
    servo2.attach(PIN_SERVO2, US_AT_0_DEG, US_AT_270_DEG);
  if (!servo3.attached())
    servo3.attach(PIN_SERVO3, US_AT_0_DEG, US_AT_270_DEG);
}

void detachAllServos() {
  if (servo1.attached())
    servo1.detach();
  if (servo2.attached())
    servo2.detach();
  if (servo3.attached())
    servo3.detach();
}

// API: Start
void handleApiStart() {
  if (server.hasArg("str"))
    targetStrength = server.arg("str").toInt();
  if (server.hasArg("cnt"))
    targetCount = server.arg("cnt").toInt();
  if (server.hasArg("preset"))
    currentSessionPreset = server.arg("preset");
  else
    currentSessionPreset = "カスタム";

  if (targetStrength > 100)
    targetStrength = 100;
  if (targetStrength < 0)
    targetStrength = 0;

  Serial.printf("[API] Start: Str=%d%%, Cnt=%d, Preset=%s\n", targetStrength,
                targetCount, currentSessionPreset.c_str());

  currentCycle = 0;
  sessionStartTime = millis();
  currentState = PREPARE_SQUEEZE;

  server.send(200, "text/plain", "OK");
}

void handleApiStop() {
  Serial.println("[API] Stop");
  currentState = IDLE;
  attachAllServos();
  setAllServosAngle(270);
  server.send(200, "text/plain", "OK");
}

void handleApiSettings() {
  if (server.hasArg("hold")) {
    holdTimeSec = server.arg("hold").toFloat();
    preferences.putFloat("hold", holdTimeSec);
  }
  if (server.hasArg("reach")) {
    reachTimeSec = server.arg("reach").toFloat();
    preferences.putFloat("reach", reachTimeSec);
  }

  String json = "{";
  json += "\"hold\":" + String(holdTimeSec) + ",";
  json += "\"reach\":" + String(reachTimeSec) + ",";
  json += "\"pin13\":" + String(pin13State);
  json += "}";
  server.send(200, "application/json", json);
}

void handleApiPin13() {
  if (server.hasArg("val")) {
    pin13State = server.arg("val").toInt();
    digitalWrite(13, pin13State ? HIGH : LOW);
    preferences.putInt("pin13", pin13State);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiStatus() {
  String s;
  switch (currentState) {
  case IDLE:
    s = "IDLE";
    break;
  case PREPARE_SQUEEZE:
    s = "PREPARE_SQUEEZE";
    break;
  case SQUEEZING:
    s = "SQUEEZING";
    break;
  case HOLDING:
    s = "HOLDING";
    break;
  case RELEASING:
    s = "RELEASING";
    break;
  case WAIT_CYCLE:
    s = "WAIT_CYCLE";
    break;
  }

  float cycleDur = reachTimeSec + holdTimeSec + 0.3;
  float totalDur = targetCount * cycleDur;

  String json = "{";
  json += "\"state\":\"" + s + "\",";
  json += "\"cycle\":" + String(currentCycle) + ",";
  json += "\"total\":" + String(targetCount) + ",";
  json += "\"elap\":" + String(millis() - sessionStartTime) + ",";
  json += "\"pin13\":" + String(pin13State) + ",";
  json += "\"dur\":" + String(totalDur);
  json += "}";
  server.send(200, "application/json", json);
}

void handleApiManual() {
  if (server.hasArg("val")) {
    int pct = server.arg("val").toInt();
    if (pct < 0)
      pct = 0;
    if (pct > 100)
      pct = 100;

    int targetUs = strengthToUs(pct);

    currentState = IDLE;
    stateStartTime =
        millis(); // Reset idle timer so it doesn't detach immediately
    attachAllServos();
    setAllServosUs(targetUs);

    Serial.printf("[API] Manual: %d%% -> %dus\n", pct, targetUs);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiManualAngle() {
  if (server.hasArg("angle")) {
    int angle = server.arg("angle").toInt();
    // 90度～270度の範囲に制限
    if (angle < 90)
      angle = 90;
    if (angle > 270)
      angle = 270;

    currentState = IDLE;
    stateStartTime = millis();
    attachAllServos();
    setAllServosAngle(angle);

    Serial.printf("[API] Manual Angle: %d degrees\n", angle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiHistory() {
  String json = "[";
  for (size_t i = 0; i < historyLog.size(); i++) {
    if (i > 0)
      json += ",";
    json += "{";
    json += "\"time\":\"" + historyLog[i].timeStr + "\",";
    json += "\"preset\":\"" + historyLog[i].preset + "\",";
    json += "\"strength\":" + String(historyLog[i].strength) + ",";
    json += "\"count\":" + String(historyLog[i].count);
    json += "}";
  }
  json += "]";
  server.send(200, "application/json", json);
}

void handleRoot() {
  String html = html_main;
  html.replace("{{BUILD_TIME}}", __DATE__ " " __TIME__);
  server.send(200, "text/html", html);
}

void setup() {
  Serial.begin(115200);

  preferences.begin("job", false);
  holdTimeSec = preferences.getFloat("hold", 0.5);
  reachTimeSec = preferences.getFloat("reach", 0.5);
  pin13State = preferences.getInt("pin13", 0);

  pinMode(13, OUTPUT);

  digitalWrite(13, pin13State ? HIGH : LOW);

  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  servo1.setPeriodHertz(50);
  servo2.setPeriodHertz(50);
  servo3.setPeriodHertz(50);

  attachAllServos();
  setAllServosAngle(270);

  // --- AP Mode Setup (Yakisoba-Shiro) ---
  WiFi.disconnect(true);
  delay(100);
  WiFi.mode(WIFI_AP);
  WiFi.softAP("焼きそば四郎"); // No Password

  Serial.print("AP IPs: ");
  Serial.println(WiFi.softAPIP());

  // DNS Server (Captive Portal)
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

  server.on("/", handleRoot);
  server.on("/api/status", handleApiStatus);
  server.on("/api/start", handleApiStart);
  server.on("/api/stop", handleApiStop);
  server.on("/api/settings", handleApiSettings);
  server.on("/api/pin13", handleApiPin13);
  server.on("/api/manual", handleApiManual);
  server.on("/api/manual_angle", handleApiManualAngle);
  server.on("/api/history", handleApiHistory);

  // Captive Portal Redirect
  server.onNotFound([]() { handleRoot(); });

  server.begin();
  Serial.println("Ready.");
}

void loop() {
  dnsServer.processNextRequest();
  server.handleClient();

  unsigned long now = millis();

  if (currentState != lastState) {
    stateStartTime = now;
    Serial.printf("State: %d\n", currentState);

    if (currentState == PREPARE_SQUEEZE) {
      attachAllServos();
      setAllServosAngle(270);
    }
    lastState = currentState;
  }

  switch (currentState) {
  case IDLE:
    // Auto Detach Removed as per user request
    break;

  case PREPARE_SQUEEZE:
    setAllServosAngle(270);
    if (now - stateStartTime > 300) {
      currentState = SQUEEZING;
    }
    break;

  case SQUEEZING: {
    unsigned long duration = reachTimeSec * 1000;
    unsigned long elapsed = now - stateStartTime;
    int startUs = US_AT_270_DEG;
    int targetUs = strengthToUs(targetStrength);

    if (elapsed >= duration) {
      setAllServosUs(targetUs);
      currentState = HOLDING;
    } else {
      float progress = (float)elapsed / (float)duration;
      int currentUs = startUs + (targetUs - startUs) * progress;
      setAllServosUs(currentUs);
    }
  } break;

  case HOLDING:
    if (now - stateStartTime >= (holdTimeSec * 1000)) {
      currentState = RELEASING;
    }
    break;

  case RELEASING:
    setAllServosAngle(270);
    if (now - stateStartTime >= 300) {
      currentState = WAIT_CYCLE;
    }
    break;

  case WAIT_CYCLE:
    currentCycle++;
    if (currentCycle < targetCount) {
      currentState = SQUEEZING;
    } else {
      Serial.println("Finished.");
      setAllServosAngle(270);
      currentState = IDLE;

      // --- 履歴保存 ---
      struct tm timeinfo;
      if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
      } else {
        char timeStringBuff[50];
        strftime(timeStringBuff, sizeof(timeStringBuff), "%Y/%m/%d %H:%M",
                 &timeinfo);

        HistoryItem newItem;
        newItem.timeStr = String(timeStringBuff);
        newItem.preset = currentSessionPreset;
        newItem.strength = targetStrength;
        newItem.count = targetCount;

        historyLog.push_back(newItem);

        // 最大保存件数 (20件)
        if (historyLog.size() > 20) {
          historyLog.erase(historyLog.begin());
        }
      }
      // ----------------
    }
    break;
  }
}
